 clc
 clear all
 close all
% X=[1.0000    0.6846    0.3500    0.6597    0.6670    1.0000    0.2973    0.0710
%     0.5333    0.2076    1.0000    0.7702    0.3287    0.2221    0.2892    0.0734
%     0.8667    0.9396    0.7778    0.8492    0.2036    0.2321    0.8705    0.3802
%     0.7733    0.5112    0.5385    0.9779    0.2652    0.1532    0.3038    0.6814
%     0.4133    0.1840    0.4375    0.5525    1.0000    0.6666    0.0796    0.8985
%     0.9600    1.0000    0.1273    1.0000    0.3615    0.2282    0.3360    0.9538
%     0.8667    0.3417    0.2500    0.8217    0.3945    0.1317    0.4010    0.9665 ];
% W=[0.15,0.2,0.05,0.1,0.15,0.1,0.1,0.15];
% I=topsis(X,W);
% %A1=xlsread('C:\Users\Administrator\Desktop\第7篇\程序\计算机硬件\machine','C3:H211');
% 
% d=mean(X);
% D1=sum(X)./7;
% I=topsis(X,W);



X=[1 2
   3 4];
X(X==3)=[]
X(3)=[]

% J = [2 1];
% [m,n] = size(X);
% A=zeros(m,n);
% for j = 1:n
% 	if J(j) == 1
%        A(:,j) = X(:,j)./sqrt(sum(X(:,j).^2));
%        %A(:,j) = X(:,j)./max(X(:,j));
%        %A(:,j) = X(:,j)./max(X(:,j));
%   %A(:,j) = (X(:,j)-min(X(:,j)))./(max(X(:,j))-min(X(:,j)));
%     else
%         %A(:,j) = min(X(:,j))./X(:,j);
%         %A(:,j) = 1-X(:,j)./max(X(:,j));
%         A(:,j) = X(:,j)./sqrt(sum(X(:,j).^2));
%    %A(:,j) = (max(X(:,j))-X(:,j))./(max(X(:,j))-min(X(:,j)));
% 	end    
% end
% TA=A 
% X=xlsread('C:\Users\Administrator\Desktop\第7篇\程序\无监督排序用\3葡萄酒\winequality-red','F2:K1600'); 
% [c,b]=find(X==0);
% X([c,b]=find(X==0))=()
clc
clear all %清楚所有数据
str1 = 'abcde' %测试数据
num = str1+0 %字母转换成数字
num2 = 102-num %数字调整








